УТ.РасширениеКонтурЛогистика/src/Catalogs/КонтурЛогистика_Партнеры/КонтурЛогистика_Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Партнеры</name>
  <attributes>
    <name>КодПартнераКонтур</name>
    <comment>Идентификатор партнера в сервисах ЭДО Контура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДЭлПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Медик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОрганизацииДиадок</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
    <attributes>
      <name>ГО</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПВ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГП</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Диспетчер</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Медик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Техник</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>boxId</name>
      <comment>ящик диадок (на случай если роуминг или несколько провайдеров)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Настройки</name>
    <attributes>
      <name>Настройка</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_Настройки</types>
        <types>CatalogRef.КонтурЛогистика_НастройкиПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_КлассификаторУпаковок</types>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
        <types>EnumRef.КонтурЛогистика_ТипыПрокси</types>
        <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
        <types>EnumRef.КонтурЛогистика_ЕдиницыИзмеренияГСМ</types>
        <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
        <types>CatalogRef.КонтурЛогистика_ГорючеСмазочныеМатериалы</types>
        <types>CatalogRef.КонтурЛогистика_Лицензии</types>
        <types>EnumRef.КонтурЛогистика_ТипыТранспортныхСредств</types>
        <types>EnumRef.КонтурЛогистика_ФункцииЗаказаЗаявки</types>
        <types>CatalogRef.Валюты</types>
        <types>EnumRef.КонтурЛогистика_МастерДанныеСотрудников</types>
        <types>CatalogRef.Контрагенты</types>
        <types>EnumRef.КонтурЛогистика_СпособыПередачиМЧД</types>
        <types>Boolean</types>
        <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
        <types>EnumRef.КонтурЛогистика_ВидыПутейСообщений</types>
        <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
        <types>EnumRef.КонтурЛогистика_ВариантыПроверкиПолномочийМЧД</types>
        <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
        <types>CatalogRef.Организации</types>
        <types>EnumRef.КонтурЛогистика_МетодыОпределенияМассы</types>
        <types>EnumRef.КонтурЛогистика_ТипыПМ</types>
        <types>String</types>
        <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
        <types>EnumRef.КонтурЛогистика_РежимыАвторизации</types>
        <types>CatalogRef.КонтурЛогистика_Договоры</types>
        <types>CatalogRef.Пользователи</types>
        <types>EnumRef.КонтурЛогистика_СпособыСопоставленияТоваровТитул3</types>
        <types>Date</types>
        <types>Number</types>
        <types>CatalogRef.ТранспортныеСредства</types>
        <types>CatalogRef.Партнеры</types>
        <types>EnumRef.КонтурЛогистика_СценарииПодписанияТитулов</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>EnumRef.КонтурЛогистика_ВариантыВалидации</types>
        <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.КонтурЛогистика_СостоянияДвиженияДокументооборота</types>
        <types>EnumRef.КонтурЛогистика_ТипыПоказанийТоплива</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
        <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
        <types>EnumRef.КонтурЛогистика_ВидыПеревозки</types>
        <types>EnumRef.КонтурЛогистика_ТипыСопроводительныхДокументов</types>
        <types>EnumRef.КонтурЛогистика_ВидыКоммерческихПеревозок</types>
        <types>CatalogRef.ЗоныДоставки</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПунктыМаршрута</name>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GLN</name>
      <comment>необязательно, (Global Location Number) — глобальный идентификационный номер. Он применяется для распознавания организаций, их частей и объектов: складов, магазинов, производств, автомобилей. GLN — международный код</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресИндекс</name>
      <comment>(варинат 2) Индекс - обязателен при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКодРегион</name>
      <comment>(вариант 2) Код региона - обязателен при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресИнфКодСтраны</name>
      <comment>(вариант 1) Страна - обязательна при указании адреса простым текстом</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресГород</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресНаселПункт</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресУлица</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресРайон</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресДом</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКорпус</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКварт</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправление</name>
      <comment>Признак, что Может выступать в этой базе данных в качестве точки:отправления</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Прибытие</name>
      <comment>Признак, что Может выступать в этой базе данных в качестве точки:прибытия</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ.РасширениеКонтурЛогистика/src/Catalogs/КонтурЛогистика_Партнеры/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПереформироватьДинСпискокТД();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПереформироватьДинСпискокТД();
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура ПереформироватьДинСпискокТД()
	
	Если ЗначениеЗаполнено(Объект.КодПартнераКонтур) Тогда 
		СопоставленияПунктовМаршрута.Параметры.УстановитьЗначениеПараметра("ПартнерСсылка", Объект.Ссылка); 
		Элементы.СопоставленияПунктовМаршрута.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
		Элементы.ПунктыМаршрута.Видимость = Не ЗначениеЗаполнено(Объект.Ссылка);
		Элементы.ГруппаНеЗаписан.Видимость = Не ЗначениеЗаполнено(Объект.Ссылка);
		Элементы.СопоставленияПунктовМаршрута.Обновить();
		Элементы.ГруппаПунктыМаршрута.Видимость = Истина;
	Иначе
		Элементы.ГруппаПунктыМаршрута.Видимость = Ложь;
		Элементы.ГруппаНеЗаписан.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОбновитьДинСписок(Параметр1, параметр2) Экспорт

	ПереформироватьДинСпискокТД();

КонецПроцедуры

&НаКлиенте
Процедура СопоставленияПунктовМаршрутаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда 
		
		ПараметрыФормы = Новый Структура;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
			
			ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ссылка);
			
		Иначе
			
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("Наименование", ТекущиеДанные.Название);
			ДанныеЗаполнения.Вставить("Адрес", ТекущиеДанные.АдресСтрока);
			ДанныеЗаполнения.Вставить("GLN", ТекущиеДанные.GLN);
			ДанныеЗаполнения.Вставить("АдресИндекс", ТекущиеДанные.АдресИндекс);
			ДанныеЗаполнения.Вставить("Партнер", Объект.Ссылка);
			ДанныеЗаполнения.Вставить("Прибытие", Истина);
			ДанныеЗаполнения.Вставить("АдресКодРегион", ТекущиеДанные.АдресКодРегион);
			ПараметрыФормы.Вставить("Основание", ДанныеЗаполнения); 
			
		КонецЕсли;
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_ПунктыМаршрута.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма, ЭтаФорма, "ОбработчикОбновитьДинСписок", ПараметрыФормы); 
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПунктыМаршрутаСервер(МассивСтруктурДанныеСтроки)
	
	Для Каждого СтруктураТочкиДоставки Из МассивСтруктурДанныеСтроки Цикл 
		
		НовыйПунктМаршрута = Справочники.КонтурЛогистика_ПунктыМаршрута.СоздатьЭлемент();
		НовыйПунктМаршрута.Заполнить(СтруктураТочкиДоставки);
		НовыйПунктМаршрута.Записать();
		
	КонецЦикла;
	
	ПереформироватьДинСпискокТД();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВыделенныеПунктыМаршрута(Команда)
	
	текВыделенныеСтроки = Элементы.СопоставленияПунктовМаршрута.ВыделенныеСтроки;

	МассивСтруктур = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из текВыделенныеСтроки Цикл
		
		ТекущиеДанные = Элементы.СопоставленияПунктовМаршрута.ДанныеСтроки(ВыделеннаяСтрока);
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда 
			
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("Наименование", ТекущиеДанные.Название);
			ДанныеЗаполнения.Вставить("Адрес", ТекущиеДанные.АдресСтрока);
			ДанныеЗаполнения.Вставить("GLN", ТекущиеДанные.GLN);
			ДанныеЗаполнения.Вставить("АдресИндекс", ТекущиеДанные.АдресИндекс);
			ДанныеЗаполнения.Вставить("Партнер", Объект.Ссылка);
			ДанныеЗаполнения.Вставить("Прибытие", Истина);
			ДанныеЗаполнения.Вставить("АдресКодРегион", ТекущиеДанные.АдресКодРегион);
			МассивСтруктур.Добавить(ДанныеЗаполнения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДобавитьПунктыМаршрутаСервер(МассивСтруктур);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиНастройкаПриИзменении(Элемент)
	
	// установить в значение дефолтное значение
	Если ЗначениеЗаполнено(Элементы.Настройки.ТекущиеДанные.Настройка) Тогда 
		Элементы.Настройки.ТекущиеДанные.Значение = 
			КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
				Элементы.Настройки.ТекущиеДанные.Настройка, "Значение");
				
	КонецЕсли;
	
КонецПроцедуры
